> (remove-duplicates '(1 2 3 3 2 1))
'(3 2 1)

> (set1? '(1 2 3 3 2 1))
#f
> (set1? '(1 2 3))
#t

> (set2? '(1 2 3 3 2 1))
#f
> (set2? '(1 2 3))
#t

> (union1 '(1 2 3) '(1 2 3))
'(1 2 3)
> (union1 '() '(1 2 3))
'(1 2 3)
> (union1 '(4) '(1 2 3))
'(4 1 2 3)

> (union2 '(1 2 3) '(1 2 3))
'(1 2 3)
> (union2 '() '(1 2 3))
'(1 2 3)
> (union2 '(4) '(1 2 3))
'(4 1 2 3)

> (union3 '(1 2 3) '(1 2 3))
'(1 2 3)
> (union3 '() '(1 2 3))
'(1 2 3)
> (union3 '(4) '(1 2 3))
'(4 1 2 3)

> (subset? '() '(1 2 3))
#t
> (subset? '(1 2) '(1 2 3))
#t
> (subset? '(1 2 3) '(1 2 3))
#t
> (subset? '(1 2 3 4) '(1 2 3))
#f

> (subset2? '() '(1 2 3))
#t
> (subset2? '(1 2) '(1 2 3))
#t
> (subset2? '(1 2 3) '(1 2 3))
#t
> (subset2? '(1 2 3 4) '(1 2 3))
#f

> (subset3? '() '(1 2 3))
#t
> (subset3? '(1 2) '(1 2 3))
#t
> (subset3? '(1 2 3) '(1 2 3))
#t
> (subset3? '(1 2 3 4) '(1 2 3))
#f
